## Introducción a Pandas

Pandas (nombre derivado de panel data, término usado para referirse a conjuntos de datos estructurados multidimensionales).

Los principales objetos ofrecidos por pandas son el **dataframe**, estructura tabular bidimensional y la **serie**, ambas basadas en el array multidimensional de NumPy.

Pandas, y en particular sus objetos Series y DataFrame, se basa en la estructura de matrices de NumPy y proporciona un acceso eficiente a este tipo de tareas de "manipulación de datos" que ocupan gran parte del tiempo de un científico de datos.

Así como generalmente importamos NumPy bajo el alias np, importaremos Pandas bajo el alias pd. Como se ha comentado, pandas se basa en la funcionalidad de NumPy, por lo que numerosas funciones de esta última librería son perfectamente aplicables a las series y a los dataframes. Para poder probarlas, también debemos importar la función NumPy,

In [32]:
import pandas as pd
import numpy as np

### Documentación y ayuda

Jupyter ofrece la posibilidad de explorar rápidamente el contenido de un paquete (utilizando la función de completado), así como la documentación de varias funciones (utilizando el carácter ?)

In [33]:
pd?

In [34]:
pd.read_csv?

In [35]:
pd.

SyntaxError: invalid syntax (Temp/ipykernel_15028/3133375982.py, line 1)

In [36]:
pd.read_csv?

Puede encontrar documentación más detallada, junto con tutoriales y otros recursos, en http://pandas.pydata.org/.

### El objeto Series

A un nivel muy básico, los objetos Pandas pueden considerarse como versiones mejoradas de las matrices estructuradas de NumPy en las que las filas y columnas se identifican con etiquetas en lugar de simples índices enteros. Una Series es un array unidimensional de datos indexados. Se puede crear a partir de una lista o un array de la siguiente manera:

In [37]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

Como vemos en la salida, la Serie envuelve tanto una secuencia de valores como una secuencia de índices, a los que podemos acceder con los atributos **values** e **index**. Los valores son simplemente una matriz NumPy:

In [38]:
print(data.values)
print(type(data.values))

[0.25 0.5  0.75 1.  ]
<class 'numpy.ndarray'>

In [39]:
type(data.index)

pandas.core.indexes.range.RangeIndex

Al igual que con un array de NumPy, se puede acceder a los datos por el índice asociado mediante la conocida notación de corchetes de Python

In [40]:
data[1]

0.5

In [41]:
data[1:3]

1    0.50
2    0.75
dtype: float64

#### Diferencias con el array de numpy

La diferencia esencial es la presencia del índice: mientras que la matriz Numpy tiene un índice entero definido implícitamente que se utiliza para acceder a los valores, la serie Pandas tiene un índice definido explícitamente asociado a los valores.

Esta definición explícita del índice proporciona al objeto Series capacidades adicionales. Por ejemplo, no es necesario que el índice sea un número entero, sino que puede consistir en valores de cualquier tipo deseado. Por ejemplo, si lo deseamos, podemos utilizar cadenas como índice:

In [42]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

Y para acceder...

In [43]:
data['b']

0.5

Incluso podemos utilizar índices no contiguos o no secuenciales:

In [44]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=[2, 5, 3, 7])
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [45]:
data[5]

0.5

#### De diccionarios a Series

Se puede pensar en una Serie de Pandas como una especialización de un diccionario de Python. Un diccionario es una estructura que asigna claves arbitrarias a un conjunto de valores arbitrarios, y una serie es una estructura que asigna claves tipificadas a un conjunto de valores tipificados.

In [46]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [47]:
population['California']

38332521

Sin embargo, a diferencia de un diccionario, la Serie también admite operaciones de tipo matriz, como el 'slicing':

In [48]:
population['California':'Florida']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
dtype: int64

### El objeto Pandas DataFrame

Al igual que el objeto Series discutido en la sección anterior, el DataFrame puede pensarse como una generalización de un array NumPy, o como una particularización de un diccionario Python.

se puede pensar en un DataFrame como una secuencia de objetos Series alineados. Por "alineados" entendemos que comparten el mismo índice.

<img src="https://storage.googleapis.com/lds-media/images/series-and-dataframe.width-1200.png" alt="drawing" width="500"/>

In [49]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

Ahora que tenemos esto junto con las series de población de antes, podemos utilizar un diccionario para construir un único objeto bidimensional que contenga esta información:

In [50]:
print(population)

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [51]:
print(area)

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [52]:
states = pd.DataFrame({'population': population,
                       'area': area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

Al igual que el objeto Series, el DataFrame tiene un atributo de índice que da acceso a las etiquetas de índice:

In [53]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

Además, el DataFrame tiene un atributo columns, que es un objeto Index que contiene las etiquetas de las columnas:

In [54]:
states.columns

Index(['population', 'area'], dtype='object')

Por lo tanto, el DataFrame puede pensarse como una generalización de un array NumPy bidimensional, donde tanto las filas como las columnas tienen un índice generalizado para acceder a los datos.

El DataFrame asigna un nombre de columna a una Serie. Por ejemplo, al pedir el atributo "area" se devuelve el objeto Serie que contiene las áreas que vimos anteriormente:

In [55]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

#### Formas de construir DataFrames

In [56]:
pd.DataFrame(np.random.rand(3, 2),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

        foo       bar
a  0.623156  0.254378
b  0.323028  0.328719
c  0.092160  0.131380

In [57]:
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [58]:
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

### Indexers: loc, iloc

Estas convenciones de 'slicing' e indexación pueden ser una fuente de confusión. Por ejemplo, si tu Serie tiene un índice entero explícito, una operación de indexación como data[1] utilizará los índices explícitos, mientras que una operación de corte como data[1:3] utilizará el índice implícito de estilo Python.

In [59]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [60]:
# explicit index when indexing
data[1]

'a'

In [61]:
# implicit index when slicing
data[1:3]

3    b
5    c
dtype: object

Debido a esta potencial confusión en el caso de los índices enteros, Pandas proporciona algunos atributos especiales de indexadores que exponen explícitamente ciertos esquemas de indexación. No se trata de métodos funcionales, sino de atributos que exponen una interfaz de 'slicing' particular a los datos de la Serie.

En primer lugar, el atributo loc permite la indexación y el corte que siempre hace referencia al índice explícito:

In [62]:
data.loc[1]

'a'

In [63]:
data.loc[1:3]

1    a
3    b
dtype: object

El atributo iloc permite la indexación y el corte que siempre hace referencia al índice implícito de estilo Python:

In [64]:
data.iloc[1]

'b'

In [65]:
data.iloc[1:3]

3    b
5    c
dtype: object

#### En DataFrames

In [66]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [67]:
#Acceder a Columnas
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [68]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [69]:
#Crear una nueva columna
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [70]:
#usando iloc
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [71]:
#usando loc
data.loc[:'Illinois', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

Dentro de estos indexadores se puede utilizar cualquiera de los patrones de acceso a datos conocidos del estilo de NumPy. Por ejemplo, en el indexador loc podemos combinar el enmascaramiento y la indexación como en lo siguiente:

In [72]:
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

Cualquiera de estas convenciones de indexación también se puede utilizar para establecer o modificar valores; esto se hace de la manera estándar a la que puede estar acostumbrado de trabajar con NumPy

In [73]:
data.iloc[0, 2] = 90
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [74]:
data[data.density > 100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

In [75]:
data[data['density'] > 5]

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

### Droppigng

In [76]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [77]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [78]:
#tambien varios
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [79]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])

In [80]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [81]:
#index
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [82]:
#columns
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

Muchas funciones, como drop, que modifican el tamaño o la forma de una Serie o DataFrame
pueden manipular un objeto en su lugar sin devolver un nuevo objeto:

In [83]:
obj.drop('c', inplace=True)

### Renaming

In [84]:
data.rename(index={'OHIO': 'INDIANA'},columns={'three': 'peekaboo'})

          one  two  peekaboo  four
Ohio        0    1         2     3
Colorado    4    5         6     7
Utah        8    9        10    11
New York   12   13        14    15

In [85]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [86]:
data.rename(index={'Ohio': 'INDIANA'})

          one  two  three  four
INDIANA     0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Usar funciones para transformar

In [87]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
....: 'Pastrami', 'corned beef', 'Bacon',
....: 'pastrami', 'honey ham', 'nova lox'],
....: 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [88]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [89]:
data["food"]=data["food"].str.upper() # .upper() .lower()

In [90]:
data

          food  ounces
0        BACON     4.0
1  PULLED PORK     3.0
2        BACON    12.0
3     PASTRAMI     6.0
4  CORNED BEEF     7.5
5        BACON     8.0
6     PASTRAMI     3.0
7    HONEY HAM     5.0
8     NOVA LOX     6.0

In [91]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

El método map de una Serie acepta una función o un objeto tipo dict que contiene un mapeo,

In [92]:
data["animal"]=data["food"].map(meat_to_animal)

In [93]:
data

          food  ounces animal
0        BACON     4.0    NaN
1  PULLED PORK     3.0    NaN
2        BACON    12.0    NaN
3     PASTRAMI     6.0    NaN
4  CORNED BEEF     7.5    NaN
5        BACON     8.0    NaN
6     PASTRAMI     3.0    NaN
7    HONEY HAM     5.0    NaN
8     NOVA LOX     6.0    NaN

### Los duplicados....

In [94]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
....: 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [95]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [96]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [97]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

### Combinaciones

Ahora, parte principal de la manipulación de los dataframes es la creacion o concatenación de columnas adicionales o la copias sobre las mismas. Esto, porque siempre estaremos se estará añadiendo información adicional que ayude sobre nuestros analísis.

In [98]:
df1 = pd.DataFrame({
'column_a':[1,2,3,4],
'column_b':['a','b','c','d'],
'column_c':[True,True,False,True]
})

df1

   column_a column_b  column_c
0         1        a      True
1         2        b      True
2         3        c     False
3         4        d      True

In [99]:
df2 = pd.DataFrame({
'column_a':[1,2,9,10],
'column_b':['a','k','l','m'],
'column_c':[False,False,False,True]
})

df2

   column_a column_b  column_c
0         1        a     False
1         2        k     False
2         9        l     False
3        10        m      True

Una forma de combinar o concatenar DataFrames es la función concat(). Puede utilizarse para concatenar DataFrames a lo largo de filas o columnas cambiando el parámetro del eje. El valor por defecto del parámetro del eje es 0, que indica la combinación a lo largo de las filas.

In [100]:
df = pd.concat([df1,df2])
df

   column_a column_b  column_c
0         1        a      True
1         2        b      True
2         3        c     False
3         4        d      True
0         1        a     False
1         2        k     False
2         9        l     False
3        10        m      True

In [101]:
df = pd.concat([df1,df2], axis=1)  # axis=1 por columnas y axis=0 por filas
df

   column_a column_b  column_c  column_a column_b  column_c
0         1        a      True         1        a     False
1         2        b      True         2        k     False
2         3        c     False         9        l     False
3         4        d      True        10        m      True

Como pueden ver en la primera figura de arriba, los índices de los DataFrames individuales se mantienen. Para cambiarlo y volver a indexar el DataFrame combinado, el parámetro ignore_index se establece como True.

In [102]:
df = pd.concat([df1,df2], ignore_index=True)
df

   column_a column_b  column_c
0         1        a      True
1         2        b      True
2         3        c     False
3         4        d      True
4         1        a     False
5         2        k     False
6         9        l     False
7        10        m      True

El parámetro join de la función concat() determina cómo combinar los DataFrames. El valor por defecto es 'outer' y devuelve todos los índices de ambos DataFrames. Si se selecciona la opción 'inner', sólo se devuelven las filas con índices compartidos. A cotinuación diferencia entre 'inner' y 'outer'.

In [103]:
df2 = pd.DataFrame({
'column_b':['y','q','n','a','k','l','m'],
'column_c':[False,False,False,False,False,False,True]
})
df2 = df2.drop([0,1,2])
df2

  column_b  column_c
3        a     False
4        k     False
5        l     False
6        m      True

In [104]:
df = pd.concat([df1,df2], axis=1, join='inner')
df

   column_a column_b  column_c column_b  column_c
3         4        d      True        a     False

In [105]:
df = pd.concat([df1,df2], axis=1, join='outer')
df

   column_a column_b column_c column_b column_c
0       1.0        a     True      NaN      NaN
1       2.0        b     True      NaN      NaN
2       3.0        c    False      NaN      NaN
3       4.0        d     True        a    False
4       NaN      NaN      NaN        k    False
5       NaN      NaN      NaN        l    False
6       NaN      NaN      NaN        m     True

La función append() también se utiliza para combinar DataFrames. Se puede ver como un caso particular de la función concat() (axis=0 y join='outer').

In [106]:
df = df1.append(df2)
df

   column_a column_b  column_c
0       1.0        a      True
1       2.0        b      True
2       3.0        c     False
3       4.0        d      True
3       NaN        a     False
4       NaN        k     False
5       NaN        l     False
6       NaN        m      True

Otra función muy utilizada para combinar DataFrames es merge(). La función Concat() simplemente añade los DataFrames uno encima del otro o los añade uno al lado del otro. Es más bien una forma de añadir DataFrames. Merge() combina los DataFrames basándose en los valores de las columnas compartidas. La función Merge() ofrece más flexibilidad que la función concat(). Se verá claramente cuando vea los ejemplos.

In [107]:
df1 = pd.DataFrame({
'column_a':[1,2,3,4],
'column_b':['a','b','c','d'],
'column_c':[True,True,False,True]
})

df1

   column_a column_b  column_c
0         1        a      True
1         2        b      True
2         3        c     False
3         4        d      True

In [108]:
df2 = pd.DataFrame({
'column_a':[1,2,9,10],
'column_b':['a','k','l','m'],
'column_c':[False,False,False,True]
})

df2

   column_a column_b  column_c
0         1        a     False
1         2        k     False
2         9        l     False
3        10        m      True

In [109]:
df_merge = pd.merge(df1, df2, on='column_a')
df_merge

   column_a column_b_x  column_c_x column_b_y  column_c_y
0         1          a        True          a       False
1         2          b        True          k       False

Los nombres de las columnas no tienen por qué ser los mismos. Nuestro objetivo son los valores de las columnas. Supongamos que dos DataFrames tienen valores comunes en una columna que desea utilizar para fusionar estos DataFrames pero los nombres de las columnas son diferentes. En este caso, en lugar del parámetro on, puede utilizar los parámetros left_on y right_on. Para mostrar la diferencia, cambiaré el nombre de la columna en df2 y luego usaré merge:

In [110]:
df2.rename(columns={'column_a':'new_column_a'}, inplace=True)
df2

   new_column_a column_b  column_c
0             1        a     False
1             2        k     False
2             9        l     False
3            10        m      True

In [111]:
df_merge = pd.merge(df1, df2, left_on='column_a', right_on='new_column_a')
df_merge

   column_a column_b_x  column_c_x  new_column_a column_b_y  column_c_y
0         1          a        True             1          a       False
1         2          b        True             2          k       False

También puede pasar múltiples valores al parámetro on. El DataFrame devuelto sólo incluye las filas que tienen los mismos valores en todas las columnas pasadas al parámetro on.

In [112]:
df2.rename(columns={'new_column_a':'column_a'}, inplace=True)
df_merge = pd.merge(df1, df2, on=['column_a','column_b'])
df_merge

   column_a column_b  column_c_x  column_c_y
0         1        a        True       False

### Lectura

En la mayoría de los casos, leemos datos de un fichero y los convertimos en un DataFrame. Pandas proporciona funciones para leer datos de muchos tipos de archivos diferentes. La más utilizada es read_csv. También existen otros tipos como read_excel, read_json, read_html, etc. Vamos a ver un ejemplo usando read_csv:

In [113]:
df = pd.read_csv("boston.csv")
df.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

Observemos las dimensiones del dataset...

In [114]:
df.shape

(506, 14)

In [115]:
#columnsa y tipo de datos
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 506 entries, 0 to 505
Data columns (total 14 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   CRIM     506 non-null    float64
 1   ZN       506 non-null    float64
 2   INDUS    506 non-null    float64
 3   CHAS     506 non-null    int64
 4   NOX      506 non-null    float64
 5   RM       506 non-null    float64
 6   AGE      506 non-null    float64
 7   DIS      506 non-null    float64
 8   RAD      506 non-null    int64
 9   TAX      506 non-null    float64
 10  PTRATIO  506 non-null    float64
 11  B        506 non-null    float64
 12  LSTAT    506 non-null    float64
 13  MEDV     506 non-null    float64
dtypes: float64(12), int64(2)
memory usage: 55.5 KB

In [ ]:
#Primeras filas
df.head()

In [ ]:
# primeras 10 filas
df.head(10)

In [ ]:
#Ultimas filas
df.tail()

In [ ]:
#ultimas 10 filas 
df.tail(10)

Con el uso de describe también podemos tener una vista genera de nuestros datos. Podemos obtener una información básica sobre ellos sin tener que indagar a analizar cada columna por aparte.

In [ ]:
df.describe()

In [ ]:
df.CHAS.value_counts()

Podemos tener información sobre los diferentes tipos de datos que tenemos. En este caso podemos evidencia que CHAS solo varía entre el uso de variables enteras int64 mientrás que las demás solo funcionan con variables de tipo decimal o de punto flotante float64.

Podemos tener información sobre los diferentes tipos de datos que tenemos. En este caso podemos evidencia que CHAS solo varía entre el uso de variables enteras int64 mientrás que las demás solo funcionan con variables de tipo decimal o de punto flotante float64.

In [ ]:
df = pd.DataFrame({
'column_a':[1, 2, 4, 4, np.nan, np.nan, 6],     
'column_b':[1.2, 1.4, np.nan, 6.2 ,None, 1.1, 4.3],
'column_c':['a', '?', 'c', 'd', '--', np.nan, 'd'],
'column_d':[True, True, np.nan, None, False, True, False]
})
df

En muchas ocasiones nos encontraremos con bases de datos con datos faltantes, en este caso descritos como NaN. Esto es muy común verlo entre grandes cantidades de datos. Dichos datos pueden generar algún tipo de ruido o imprecisión sobre nuestro análisis. Por tanto, aprenderémos a como identificarlos e eliminarlos en caso de ser necesario.

In [ ]:
df.isna()

Con isNa tenemos información sobre que variables que tenemos dentro de nuestro dataframe. Podemos ver notna caso contrario al anterior visto.

In [ ]:
df.isna().sum()

Podemos sumar la cantidad de NaN o datos faltantes por columnas.

In [ ]:
df.replace(['?','--'],np.nan, inplace=True)
df

Podemos remplazar otros valores como el ? o el -- por NaN. Para tener una normalización de datos faltantes.

In [ ]:
df.dropna(axis=0)

O, eliminar de la base de datos registros completos en caso de tener un valor NaN. Caos más utilizado para no generar algún tipo de ruido en los datos. El axis = 0 indica que haga el análisis tomando en cuenta las columnas como criterio de decisión de eliminación. En caso de que fuera axis = 1, estaría buscando por columna donde exista algún NaN, y eliminaría toda la columna, como se muestra a continuación.

In [ ]:
df = pd.DataFrame({
'column_a':[1, 2, 4, 4, np.nan, np.nan, 6],     
'column_b':[1.2, 1.4, np.nan, 6.2 , np.nan, 1.1, 4.3],
'column_c':['a', '?', 'c', 'd', np.nan, np.nan, 'd'],
'column_d':[True, True, False, True, False, True, False]
})
df

Dataframe ahora con columna D sin ningún NaN

In [ ]:
df.dropna(axis=1)

Resultado final solo teniendo en cuenta que la columna D cumple con no tener ningún NaN

In [ ]:
df = pd.DataFrame({
'column_a':[1, 2, 4, 4, np.nan, np.nan, 6],     
'column_b':[1.2, 1.4, np.nan, 6.2 , np.nan, 1.1, 4.3],
'column_c':['a', '?', 'c', 'd', np.nan, np.nan, 'd'],
'column_d':[True, True, False, True, False, True, False]
})
df

Podemos también rellenar un NaN con un valor escalar o valor fijo

In [ ]:
df.fillna(1.0)

O podemos rellenarlo con algo más común como una media de la columna

In [ ]:
df = pd.DataFrame({
'column_a':[1, 2, 4, 4, np.nan, np.nan, 6],     
'column_b':[1.2, 1.4, np.nan, 6.2 , np.nan, 1.1, 4.3],
'column_c':['a', '?', 'c', 'd', np.nan, np.nan, 'd'],
'column_d':[True, True, False, True, False, True, False]
})
df

In [ ]:
mean = df.column_a.mean()
df.column_a.fillna(mean)

También podemos rellenarlo según e dato anterior presentado con df.fillna(axis=0,method="ffill") ffill refenriendóse a forward fill.

### Referencias



*   https://interactivechaos.com/es/manual/tutorial-de-pandas/union-de-series-y-dataframes
*   https://jakevdp.github.io/PythonDataScienceHandbook/index.html

* Python for Data Analysis: Data Wrangling with Pandas, NumPy, and IPython. Wes McKinney